Моя_родословная/src/Catalogs/Персоны/Персоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Персоны</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмерти</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоСмерти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФотографии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НынеЖив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьДатыРождения</name>
    <type>
      <types>EnumRef.ТочностьДаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьДатыСмерти</name>
    <type>
      <types>EnumRef.ТочностьДаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Биография</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Родственники</name>
    <attributes>
      <name>ТипРодства</name>
      <type>
        <types>CatalogRef.ТипыРодства</types>
      </type>
    </attributes>
    <attributes>
      <name>Персона</name>
      <type>
        <types>CatalogRef.Персоны</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Семьи</name>
    <attributes>
      <name>Семья</name>
      <type>
        <types>CatalogRef.Семьи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаПребывания</name>
    <attributes>
      <name>ТипМеста</name>
      <type>
        <types>EnumRef.ТипМестПребывания</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.АдминистративноеДеление</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПрежнейГеографии</name>
      <type>
        <types>CatalogRef.АдминистративноеДеление</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Моя_родословная/src/Enums/ТочностьДаты/ТочностьДаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТочностьДаты</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Десятилетие</name>
  </enumValues>
</mdclass:Enum>

Моя_родословная/src/Catalogs/Персоны/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура АдресФотографииНажатие(Элемент, СтандартнаяОбработка)
	
	ООЗавершениеПомещенияФайла = Новый ОписаниеОповещения("ЗавершениеПомещенияФайла", ЭтаФорма);
	НачатьПомещениеФайла(ООЗавершениеПомещенияФайла, , , Истина, ЭтаФорма.УникальныйИдентификатор);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПомещенияФайла(Результат, АдресПомещенногоФайла, ВыбранноеИмяФайла, ДополнительныйПараметр) Экспорт
	
	Если Результат = Истина Тогда
		
		АдресФотографии = АдресПомещенногоФайла;
		Модифицированность = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПустаяСтрока(АдресФотографии) Тогда
		
		Попытка
			ТекущийОбъект.ХранилищеФотографии = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФотографии));
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.ХранилищеФотографии <> Неопределено Тогда
		
		АдресФотографии = ПоместитьВоВременноеХранилище(ТекущийОбъект.ХранилищеФотографии.Получить());
		
	КонецЕсли;
	
	УстановитьФорматРедактированияДаты(Элементы.ДатаРождения, ТекущийОбъект.ТочностьДатыРождения);
	УстановитьФорматРедактированияДаты(Элементы.ДатаСмерти, ТекущийОбъект.ТочностьДатыСмерти);
	УстановитьВидимостьГруппыДатыСмерти(Элементы.ГруппаДатыСмерти, Не ТекущийОбъект.НынеЖив);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФорматРедактированияДаты(Элемент, ТочностьДаты)
	                                                          
	Если ТочностьДаты = ПредопределенноеЗначение("Перечисление.ТочностьДаты.Год") Или ТочностьДаты = ПредопределенноеЗначение("Перечисление.ТочностьДаты.Десятилетие") Тогда
		Элемент.ФорматРедактирования = "ДФ='yyyy'";
	ИначеЕсли ТочностьДаты = ПредопределенноеЗначение("Перечисление.ТочностьДаты.Месяц") Тогда	
		Элемент.ФорматРедактирования = "ДФ='MM yyyy'";
	Иначе
		Элемент.ФорматРедактирования = "";
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьГруппыДатыСмерти(Элемент, Видимость)
	                                                          
	Элемент.Видимость = Видимость;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьДатыРожденияПриИзменении(Элемент)
	
	УстановитьФорматРедактированияДаты(Элементы.ДатаРождения, Объект.ТочностьДатыРождения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочностьДатыСмертиПриИзменении(Элемент)
	
	УстановитьФорматРедактированияДаты(Элементы.ДатаСмерти, Объект.ТочностьДатыСмерти);
	
КонецПроцедуры

&НаКлиенте
Процедура НынеЖивПриИзменении(Элемент)
	
	УстановитьВидимостьГруппыДатыСмерти(Элементы.ГруппаДатыСмерти, Не Объект.НынеЖив);	
	
КонецПроцедуры
